//*****************************************************************//
//*****************************************************************//
//*****************************************************************//
//**                                                             **//
//**         (C)Copyright 2010, American Megatrends, Inc.        **//
//**                                                             **//
//**                     All Rights Reserved.                    **//
//**                                                             **//
//**   5555 Oakbrook Pkwy, Building 200,Norcross, Georgia 30093  **//
//**                                                             **//
//**                     Phone (770)-246-8600                    **//
//**                                                             **//
//*****************************************************************//
//*****************************************************************//
//*****************************************************************//
// $Archive: $
//
// $Author: $
//
// $Revision: $
//
// $Date: $
//
//*****************************************************************//
//*****************************************************************//
//*****************************************************************//

/=#

//CAUTION: Do not add new string tokens, when TSE source module is
//not present. When TSE source module is not present, usage of this
//file is restricted to only modification of strings; otherwise
//outcome is unpredictable. When you TSE sources and want to add a
//new string add the token in FakeTokens.c
#include "VFR.uni"

#string STR_NAV_STRINGS_0        #language    eng    "Esc : Quit                              ↑ ↓ → ← : Select Item\nF4 : Save & Exit Setup"
                                 #language    fra    "Esc : Quit                              ↑ ↓ → ← : Select Item\nF4 : Save & Exit Setup"
                                 #language    chi    "Esc : 離開                              ↑ ↓ → ← : 選擇項目\nF4 : 儲存並離開"
#string STR_NAV_STRINGS_1        #language    eng    " ↑↓→←:Move  Enter:Select  F1:General Help\n     F2:Previous Values    F3:Optimized Defaults  F4:Save  ESC:Exit"
                                 #language    fra    " ↑↓→←:Move  Enter:Select  F1:General Help\n     F2:Previous Values    F3:Optimized Defaults  F4:Save  ESC:Exit"
                                 #language    chi    " ↑↓→←:移動  Enter:選擇  F1:一般性提示\n     F2:之前設定值    F3:最佳化預設值  F4:儲存  ESC:離開"
#string STR_NAV_STRINGS_2        #language    eng    "→←: Select Screen\n↑↓: Select Item\nEnter: Select\n+/-: Change Opt.\nF1: General Help\nF2: Previous Values\nF3: Optimized Defaults\nF4: Save & Exit\nESC: Exit\nk: Scroll help area upwards\nm: Scroll help area downwards"
                                 #language    fra    "→←: Select Screen\n↑↓: Select Item\nEnter: Select\n+/-: Change Opt.\nF1: General Help\nF2: Previous Values\nF3: Optimized Defaults\nF4: Save & Exit\nESC: Exit"
                                 #language    chi    "→←: 選擇畫面\n↑↓: 選擇項目\nEnter: 選擇\n+/-: 變更\nF1: 一般性提示\nF2: 之前設定值\nF3: 最佳化預設值\nF4: 儲存  ESC: 離開"
#string STR_NAV_STRINGS_3        #language    eng    "→←: Select Screen\n↑↓/Click: Select Item\nEnter/Dbl Click: Select\n+/-: Change Opt.\nF1: General Help\nF2: Previous Values\nF3: Optimized Defaults\nF4: Save & Exit\nESC/Right Click: Exit"
                                 #language    fra    "→←: Select Screen\n↑↓/Click: Select Item\nEnter/Dbl Click: Select\n+/-: Change Opt.\nF1: General Help\nF2: Previous Values\nF3: Optimized Defaults\nF4: Save & Exit\nESC/Right Click: Exit"
                                 #language    chi    "→←: Select Screen\n↑↓/Click: Select Item\nEnter/Dbl Click: Select\n+/-: Change Opt.\nF1: General Help\nF2: Previous Values\nF3: Optimized Defaults\nF4: Save & Exit\nESC/Right Click: Exit"


#string STR_EXIT_HELP            #language    eng    "Abandon all Data"
                                 #language    fra    "Abandon all Data"
                                 #language    chi    "放棄所有資料"

#string STR_RESET_HELP           #language    eng    "Abandon all Data"
                                 #language    fra    "Abandon all Data"
                                 #language    chi    "放棄所有資料"


#string STR_NAV_STRINGS_4        #language    eng    "Item Specific Help"
#string STR_NAV_STRINGS_5	     #language    eng    "[1;37;m  F1[;;m    Help      [1;37;m↑↓[;;m     Select Item     [1;37;mF2   [;;m   Previous Values     [1;37;mF3[;;m   Optimal Defaults\n[1;37;m ESC[;;m   Exit      [1;37;m→←[;;m     Select Menu     [1;37;mEnter[;;m   Select Sub-Menu     [1;37;mF4[;;m   Save and Exit  "

//<zhanghy2007-20200413 change STR_NAV_STRINGS_5 +>
#string STR_NAV_STRINGS_5_AK	 #language    eng    "[1;32;m  F1[;;m    Help      [1;32;m↑↓[;;m     Select Item     [1;32;mF2   [;;m   Previous Values     [1;32;mF3[;;m   Optimal Defaults\n[1;32;m ESC[;;m   Exit      [1;32;m→←[;;m     Select Menu     [1;32;mEnter[;;m   Select Sub-Menu     [1;32;mF4[;;m   Save and Exit  "
//<zhanghy2007-20200413 change STR_NAV_STRINGS_5 ->

#string STR_NAV_STRINGS_6      	 #language    eng    "[1;37;mF1[;;m   Help   [1;37;m↑↓[;;m   SelectItem   [1;37;mF2[;;m    Previous Values   [1;37;mF3[;;m   Optimal Defaults\n[1;37;mECS[;;m  Exit   [1;37;m→←[;;m   SelectMenu   [1;37;mEnter[;;m Select Sub-Menu   [1;37;mF4[;;m   Save and Exit   "

//<zhanghy2008-20200413 change STR_NAV_STRINGS_6 +>
#string STR_NAV_STRINGS_6_AK     #language    eng    "[1;32;mF1[;;m   Help   [1;32;m↑↓[;;m   SelectItem   [1;32;mF2[;;m    Previous Values   [1;32;mF3[;;m   Optimal Defaults\n[1;32;mECS[;;m  Exit   [1;32;m→←[;;m   SelectMenu   [1;32;mEnter[;;m Select Sub-Menu   [1;32;mF4[;;m   Save and Exit   "
//<zhanghy2008-20200413 change STR_NAV_STRINGS_6 ->

#string STR_NAV_STRINGS_7        #language    eng    "↑↓→←      : Move\nEnter     : Select Sub-Menu\nF5/F6     : Value\nESC       : Exit\nF1        : Help\nF9        : Setup Defaults\nF10       : Save & Exit Setup"

#string STR_SET_PASSWORD_PROMPT         #language eng "Set Password"
#string STR_CHANGE_PASSWORD_PROMPT      #language eng "Change Password"
#string STR_PASSWORD_SUCCESS_MSG        #language eng "Password has been set"
#string STR_PASSWORD_CLEARED_MSG        #language eng "Password has been cleared"
#string STR_SUCCESS                     #language eng "SUCCESS"
#string STR_INFO                        #language eng "INFO"
